app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "address1", "address2", "created_at", "address3", "updated_at", "approved", "website", "phone", "fax", "description", "lat", "email", "long") VALUES('John', '6 Stanley Av', 'Penwortham', '2009-11-04 23:27:53', 'Preston', '2009-11-04 23:27:53', 'f', 'http://john.com', '01772740839', '01772 6409784', 'My Company', '', 'john@giddygoat.co.uk', '')
---
  def create
    @company = Company.new(params[:company])
    if @company.save

SELECT * FROM "companies"
---
  def index
    @companies = Company.all

SELECT * FROM "companies" WHERE ("companies"."id" = 1)
---
  def show
    @company = Company.find(params[:id])

SELECT * FROM "companies" WHERE ("companies"."id" = 1)
---
  def edit
    @company = Company.find(params[:id])